{
    "entry_point": "openshop_problem:OpenShopProblem",
    "default_params": {
      "instance_file": "instances/tai44_0.txt"
    },
    "problem_type": "Open Shop Scheduling",
    "description": "In the open shop scheduling problem, a set of jobs must be processed on every machine of the shop. Each job consists of one activity per machine, and the activities may be performed in any order, as long as no two activities of the same job overlap. Additionally, each machine can process at most one activity at a time. The objective is to minimize the makespan, i.e. the time when all activities have been completed. The instance is given in the Taillard format: first, the processing times for each job (in an arbitrary task order) are provided, then the machine indices for each activity (defining the assignment of activities to machines). The processing times are re-ordered accordingly.",
    "keywords": [
      "open shop",
      "scheduling",
      "makespan",
      "Taillard"
    ],
    "data_format": {
      "instance_file": {
        "format": "A text file in the Taillard format. The first line is a header. The second line contains five numbers, where the first two are the number of jobs and the number of machines. The next nb_jobs lines provide the processing times for each job in a given task order. The following nb_jobs lines list the machine indices (1-indexed) corresponding to each task in the same order."
      }
    },
    "decision_variables": {
      "jobs_order": {
        "type": "list of lists of int",
        "description": "For each machine, a permutation (list) of job indices (0-indexed) representing the order in which jobs are processed on that machine."
      },
      "machines_order": {
        "type": "list of lists of int",
        "description": "For each job, a permutation (list) of machine indices (0-indexed) representing the order in which the job's activities are scheduled."
      }
    },
    "objective": {
      "type": "minimization",
      "function": "Makespan = max{ end(tasks[j][m]) for all jobs j and machines m }",
      "description": "Minimize the makespan, defined as the maximum completion time among all activities. Each activity's duration is fixed (equal to its processing time) and must be scheduled so that no two activities on the same machine overlap and no two activities of the same job run concurrently."
    },
    "solution_representation": "A dictionary with keys 'jobs_order' (a list of job sequences, one per machine) and 'machines_order' (a list of machine sequences, one per job).",
    "compatible_optimizers": [
      "genetic_algorithm",
      "simulated_annealing",
      "particle_swarm",
      "tabu_search"
    ]
  }
  